crosser/freshlist-epd/sdkconfig.defaults.TRMNL
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_HWE_DISPLAY_SPI_SCK=7
CONFIG_HWE_DISPLAY_SPI_MOSI=9
CONFIG_HWE_DISPLAY_SPI_MISO=-1
CONFIG_HWE_DISPLAY_SPI_DC=10
CONFIG_HWE_DISPLAY_SPI_CS=44
CONFIG_HWE_DISPLAY_RST=38
CONFIG_HWE_DISPLAY_BUSY=4
CONFIG_HWE_DISPLAY_LED=21
CONFIG_HWE_DISPLAY_LED_ON_LVL=0
CONFIG_HWE_DISPLAY_ENABLE=43
CONFIG_HWE_DISPLAY_WIDTH=800
CONFIG_HWE_DISPLAY_HEIGHT=480
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH=y
CONFIG_LCD_ENABLE_DEBUG_LOG=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_RDNSS_MAX_DNS_SERVERS=1
CONFIG_LWIP_IPV6_DHCP6=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_WS_TRANSPORT=n
CONFIG_LV_COLOR_DEPTH_1=y
CONFIG_LV_FONT_MONTSERRAT_14=n
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_28=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
